/obj/item/paper/tdroid_manual
	name = "руководство по эксплуатации боевых андроидов"
	info = "<h2>\"me подкрадывается и ломает четвертую стену</h2><br> \
		азазхвзахвахзазхвазахв вы были затроллены, у вас бивалент!!!<br> \
		1.Поинт на себя с дизарм интентом чтобы объединить и сбросить цели нескольких андроидов в радиусе 5 метров в отряд, так они не будут друг друга убивать (в теории).<br>  \
		2.Поинт на себя с харм интентом чтобы переключить режим агрессии. Со включеным режимом агрессии андроиды будут автоматически атаковать всех, кто не коммандир и не в отряде.<br>  \
		3.Поинт на андроида с дизарм интентом чтобы сбросить его цели и уронить на 5 секунд.<br>  \
		4.Поинт на живое существо не в отряде с дизарм интентом чтобы андроиды начали приказывать ему сдаться, и в случае неподчинения начинали производить распидорас.<br>  \
		4.1 Поинт на живое существо не в отряде с харм интентом чтобы андроиды начали сразу производить его распидорас.<br>  \
		4.2 Поинт на живое существо не в отряде с харм интентом два раза чтобы андроиды начали производить его распидорас насмерть.<br>  \
		5.Поинт на андроида с граб интентом для перехода в режим приказов конкретно этому андроиду.<br>  \
		5.1 Поинт на объект с граб интентом для следования за ним. В случае, когда объект это другой андроид из отряда - первый андроид его схватит и потащит.<br>  \
		Извени что канцелярит и не понятно, 5 лет космошараги и не такое с людьми делают... \
		"

/obj/item/firing_pin/catatonic
	name = "ударник для дэбов"
	desc = "Позволяет стрелять только \"гуманоидам\" с айсикью меньше 10."
	fail_message = span_warning("ОБНАРУЖЕНА МОЗГОВАЯ АКТИВНОСТЬ.")

/obj/item/firing_pin/catatonic/pin_auth(mob/living/user)
	if(!istype(user))
		return FALSE
	if(user.client)
		return FALSE
	return TRUE

/obj/item/storage/box/syndie_kit/tacticalcore
	name = "набор тактических ядер"
	desc = "Смешная коробка с приколами."

/obj/item/storage/box/syndie_kit/tacticalcore/PopulateContents()
	new /obj/item/paper/tdroid_manual(src)
	for(var/i in 1 to 3)
		new /obj/item/firing_pin/catatonic(src)
	for(var/i in 1 to 3)
		new /obj/item/organ/tactical_core(src)
