#!/usr/bin/python3
import os
#Magick huita

byond_enc = ["1040","1072","1041","1073",
	"1042","1074","1043","1075",
	"1044", "1076","1045","1077",
	"1046","1078","1047","1079",
	"1048", "1080","1049","1081",
	"1050","1082","1051","1083",
	"1052","1084","1053","1085",
	"1054", "1086","1055","1087",
	"1056","1088","1057","1089",
	"1058","1090","1059","1091",
	"1060","1092","1061","1093",
	"1062","1094","1063","1095",
	"1064","1096","1065","1097",
	"1066","1098","1067","1099",
	"1068", "1100","1069","1101",
	"1070", "1102","1071","1103",
	"1025", "1105"]

byond_dec = ["А","а","Б","б","В","в","Г","г","Д","д","Е","е",
             "Ж","ж","З","з","И","и","Й","й","К","к","Л","л","М",
             "м","Н","н","О","о","П","п","Р","р","С","с","Т","т",
             "У","у","Ф","ф","Х","х","Ц","ц","Ч","ч","Ш","ш","Щ",
             "щ","Ъ","ъ","Ы","ы","Ь","ь","Э","э","Ю","ю","Я","я",
             "Ё","ё"]

def conv_log(path):
    f = open(path)
    buf = f.read()
    f.close()
    for i in range(len(byond_enc)):
        buf = buf.replace("&#"+byond_enc[i]+";", byond_dec[i])
    #print(buf)
    f = open(path, 'w')
    f.write(buf)
    f.close()

#path = os.getcwd()
#f_list = os.listdir(path)
#dir_list = list(filter(lambda x: x.rfind('.')==-1, f_list))#Получаем все директории с помощью... МАГИИ
p = str(input("Type path to *.log file:"))
conv_log(p)

