//////////////////////////////////////
//
// примерно понимаю как это сделать
//
// поэтому сделаю велосипед по своим идеям
//
//////////////////////////////////////

/obj
	var/ru_name
	var/ru_desc

/obj/Initialize()
	. = ..()
	if (!ru_name)
		ru_name = name

/mob
	var/ru_name
	var/ru_desc

/mob/Initialize()
	. = ..()
	if (!ru_name)
		ru_name = name

/turf
	var/ru_name
	var/ru_desc

/turf/Initialize()
	. = ..()
	if (!ru_name)
		ru_name = name

//////////////////////////////////////
//
// кстати, в теории можно прям тут и переводить имена
//
// но с мержами будет достаточно багельсов с этим же. Посмотрим
//
//////////////////////////////////////

